FemDesign.Reinforcement.Stirrups.#ctor
Parameterless constructor for serialization

FemDesign.Reinforcement.Stirrups.#ctor(FemDesign.Geometry.Region,System.Double,System.Double,System.Double)
Construct stirrups by start and end distance from bar start.

FemDesign.Reinforcement.Stirrups.#ctor(FemDesign.Bars.Bar,FemDesign.Geometry.Region,System.Double,System.Double,System.Double)
Construct stirrups by start and end parameter on the bar.